## Series의 값이 많은 경우

In [2]:
import pandas as pd
import numpy as np

# Series의 값이 많은 경우
#처음 5개, 끝 5개가 출력됨

nums = pd.Series(range(500))
nums # ㆍㆍㆍ이란 표시는 생략되었다는 의미

#많은 데이터를 출력하게 되면 주피터에 부하가 올 수 있기 때문

0        0
1        1
2        2
3        3
4        4
      ...
495    495
496    496
497    497
498    498
499    499
Length: 500, dtype: int64

# Series 메서드 정리

## Series head() 메서드

In [2]:
# Series head() 메서드 

# head() 메서드는 앞부터 출력할 데이터의 개수 지정
nums.head() # 디폴트는 5개

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [3]:
nums.head(10) # 괄호 안에 숫자를 넣어서 출력할 데이터 개수 지정 가능

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

## Series tail() 메서드

In [4]:
# Series tail() 메서드

# tail() 메서드는 맨 뒤에서부터 출력할 데이터의 개수 지정
nums.tail() # 디폴트는 5개

495    495
496    496
497    497
498    498
499    499
dtype: int64

In [5]:
nums.tail(10) # head()와 같은 방식으로 괄호 안에 숫자를 넣어서
              # 출력할 데이터 개수 지정 가능

490    490
491    491
492    492
493    493
494    494
495    495
496    496
497    497
498    498
499    499
dtype: int64

# Series 수학 연산 메서드 정리

In [6]:
# Series 수학 연산

nums = pd.Series([1, 2, np.nan, 4, 5])
nums # np.nan에 의해 float으로 자료형 통일

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

## Series 수학 연산 - nunique()

In [7]:
## Series 수학 연산 nunique() 메서드

# nunique() 메서드는 고유한 값의 개수를 계산할 때 사용
# 아래 예제에서 'h','e','l','l','o'의 값을 갖는 Series 객체에서
# 고유한 값인 'h', 'e', 'l', 'o'에 대한 개수를 구해준다.

hello = pd.Series(list("hello"))

## Series 수학 연산 - count()

In [8]:
## Series 수학 연산 count() 메서드

# count() 메서드는 데이터의 개수를 계산한다.
# 이 때 NaN인 값에 대해서는 개수에 포함시키지 않는다.

# len()은 그와 별개로 전체 길이를 알려준다.
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [9]:
nums.count()

4

In [10]:
len(nums)

5

## Series 수학 연산 - sum()

In [11]:
## Series 수학 연산 sum() 메서드

# sum() 메서드는 Series에 있는 데이터를 모두 더한다.
# 대부분의 수학 연산과 관련된 메서드는 결측치를 포함하지 않고 계산

# 이는 skipna 파라미터의 기본 값이 True이기 때문이다.
# skipna의 값을 False로 전달하면 결측값을 포함한 계산 결과가 나온다.
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [12]:
nums.sum()

12.0

In [13]:
nums.sum(skipna = False)

nan

## Series 수학 연산 mean(), median(), std()

In [14]:
## Series 수학 연산 mean(), median(), std() 메서드

# mean()은 평균
# median()은 중앙값
# std()는 표준편차
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [15]:
nums.mean()

3.0

In [16]:
nums.median()

3.0

In [17]:
nums.std()

1.8257418583505538

## Series 수학 연산 max(), min()

In [18]:
## Series 수학 연산 max(), min() 메서드

# max()는 Series에서 가장 큰 값 검색
# min()는 Series에서 가장 작은 값 검색
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [19]:
nums.max()

5.0

In [20]:
nums.min()

1.0

### 문자에 대한 max(), min()

In [21]:
### 문자에 대한 max(), min()메서드

# Series의 값이 문자인 경우도 최대값과 최소값을 구할 수 있다.

# ord() 함수는 하나의 문자를 Unicode 숫자로 변경
# 그 크기를 통해 최대값과 최소값 검색

somechar = pd.Series(list("AaBbCc"))
somechar

0    A
1    a
2    B
3    b
4    C
5    c
dtype: object

In [22]:
somechar.max()

'c'

In [23]:
somechar.min()

'A'

In [24]:
ord('a')

97

In [25]:
ord('A')

65

## Series 수학 연산 - describe() (모든 통계)

In [26]:
## Series 수학 연산 describe() 메서드

# describe() 메서드는 수치 값을 갖는 Series에 대해
# count, mean, std, min, 25%, median(50%), 75%, max에 대한
# 모든 통계를 구해준다.
nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [27]:
nums.describe()

count    4.000000
mean     3.000000
std      1.825742
min      1.000000
25%      1.750000
50%      3.000000
75%      4.250000
max      5.000000
dtype: float64

In [28]:
# object 값을 갖는 Series에 대해서는 데이터 수인 count,
# 고유한 값의 수인 unique, 최빈 값 top, 
# 최빈 값의 빈도 freq에 대한 값을 구해준다.
hello

0    h
1    e
2    l
3    l
4    o
dtype: object

In [29]:
hello.describe()

count     5
unique    4
top       l
freq      2
dtype: object

# Series의 변환

In [30]:
# Series의 변환

# Series는 파이썬의 기본 자료구조로 변경 가능

nums

0    1.0
1    2.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [31]:
# list() 함수를 사용하여 nums에 담긴 Series 객체를 list 객체로 변경함
list(nums)

[1.0, 2.0, nan, 4.0, 5.0]

In [32]:
# dict() 함수를 사용하여 nums Series 객체를 닥셔너리 객체로 변환
# Series의 index는 dict의 key가 되고,
# Series의 value는 dict의 values가 된다.
dict(nums)

{0: 1.0, 1: 2.0, 2: nan, 3: 4.0, 4: 5.0}

# pandas 데이터 입출력

In [33]:
# index와 values로 사용된 두 컬럼만으로 구성된
# CSV 파일은 Series로 읽어올 수 있다.

# 이때 index_col이란 매개변수로 인덱스로 사용할 Column의 이름을 지정해주고,
# squeeze라는 매개변수에 True 값을 전달해야 한다.

# squeeze 메서드는 하나의 열을 갖는 DataFrame을 Series로 변환
# index_col은 index로 사용할 column을 지정
pokemons = pd.read_csv("C:/python/datas/pokemon.csv", index_col = "Pokemon").squeeze()
# squeez()메서드 사용 권장(squeeze = True 인수 형식은 없어질 예정)

## Series의 값 정렬하기 sort_values() 메서드

In [34]:
# Series의 값 정렬하기 sort_values() 메서드

# Series가 갖는 값을 정렬할 때 사용할 수 있는 메서드가 sort_values()
pokemons.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [35]:
# sort_values()는 기본적으로 오름차순이다.
# 만약 내림차순 하고 싶다면 괄호 안에 
# ascending = False를 쓰면 된다.

pokemons.sort_values(ascending = False)

Pokemon
Empoleon      Water / Steel
Corsola        Water / Rock
Relicanth      Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
                  ...
Kricketune              Bug
Cascoon                 Bug
Scatterbug              Bug
Kricketot               Bug
Grubbin                 Bug
Name: Type, Length: 809, dtype: object

### 문자로 된 날짜/시간 데이터 파싱하기

In [36]:
## 문자로 된 날짜/시간 데이터 파싱하기

google = pd.read_csv("C:/python/datas/google_stocks.csv",
                     parse_dates = ["Date"],
                     # parse_dates 인수에 파싱할 column명을 
                     # 리스트 형태로 전달하면 된다.
                     index_col = "Date"
                     ).squeeze('columns')
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [37]:
## csv 파일에서 필요한 column만 가져오기

# usecols 인수를 활용하면
# csv 파일로부터 pandas가 가져와야 하는 열의 목록 지정 가능

war = pd.read_csv("C:/python/datas/revolutionary_war.csv",
                  parse_dates = ["Start Date"],
                  index_col = "Start Date",
                  usecols = ["Start Date", "State"]
                 ).squeeze('columns')
war

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [38]:
## NaN 값 정렬위치

# na_position이라는 인수에 first, last를 쓰면 된다.

war.sort_values(na_position = "first")

Start Date
1775-09-17         NaN
1775-12-31         NaN
1776-03-03         NaN
1776-03-25         NaN
1776-05-18         NaN
                ...
1781-07-06    Virginia
1781-07-01    Virginia
1781-06-26    Virginia
1781-04-25    Virginia
1783-01-22    Virginia
Name: State, Length: 232, dtype: object

In [39]:
war.sort_values(na_position = "last")

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [40]:
## Series의 값중 NaN 배제하기 dropna()

# dropna() 메서드를 통해 직접 NaN 값 배제 가능
war.dropna()

Start Date
1774-09-01     Massachusetts
1774-12-14     New Hampshire
1775-04-19     Massachusetts
1775-04-19     Massachusetts
1775-04-20          Virginia
                   ...
1782-08-15          Virginia
1782-08-19          Virginia
1782-08-26    South Carolina
1782-09-11          Virginia
1783-01-22          Virginia
Name: State, Length: 162, dtype: object

In [41]:
# Series의 index를 기준으로 정렬하기

# values가 아닌 index 기준 정렬
# sort_index() 메서드를 활용

# 기본 정렬은 오름차순 ascending = True 상태
# 내림차순을 원하면 괄호 안에 ascending = False 입력

pokemons.sort_index()

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [42]:
# NaT는 Not a Time의 줄임말

# NaN은 float인 반면, NaT는 Datetime(날짜/시간) 유형의 데이터
war.sort_index()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [43]:
## NaN 값 정렬위치

# sort_index() 메서드에서도 na_position 인수 사용 가능
war.sort_index(na_position = "first")

Start Date
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
1774-09-01    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

In [44]:
war.sort_index(na_position = "last")

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1783-01-22         Virginia
NaT              New Jersey
NaT                Virginia
NaT                     NaN
NaT                     NaN
Name: State, Length: 232, dtype: object

In [45]:
## Series의 index에 NaT 배제하기

# 1. dropna() 메서드 사용
war.loc[war.index.dropna()] # index 중복이 없어야 올바른 결과 보여줌
# 따라서 war index는 value가 2개씩 있는 index가 11개 있으므로 dropna에서 걸러지지 않고 남음

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-19    Massachusetts
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 250, dtype: object

In [46]:
# 2. notnull() 메서드 사용
war.loc[war.index.notnull()]
# notnull은 중복을 허용 안함

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 228, dtype: object

In [47]:
#연습문제
#google 변수에 담긴 Series 객체에 대해서 가장 큰 값 10개와 가장 작은 값 10개를 출력해보세요.

# Series nsmallest(), nlargest() 메서드

In [48]:
# Series nsmallest(), nlargest() 메서드

# nsmallest()는 작은 값을 순서대로 인수의 숫자만큼 구해줌
# nlargest()는 큰 값을 순서대로 인수의 숫자만큼 구해줌

google.nlargest(10)

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
2018-07-25    1263.70
2019-04-25    1263.45
2019-10-24    1260.99
2019-10-23    1259.13
2019-04-24    1256.00
Name: Close, dtype: float64

In [49]:
google.nsmallest(10)

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
2004-08-30    50.81
2004-09-08    50.96
2004-09-09    50.96
2004-08-31    50.99
2004-08-24    52.24
Name: Close, dtype: float64

In [50]:
# Series value_counts() 메서드

# value_counts() 메서드는 Series 내 데이터의 고유한 값의 빈도를 볼 때 활용
#값을 내림차순으로 정리해줌
#len을 붙이면 nunique와 같은 값을 줌

pokemons.value_counts()

Normal                65
Water                 61
Grass                 38
Psychic               35
Fire                  30
                      ..
Fire / Psychic         1
Normal / Ground        1
Psychic / Fighting     1
Dark / Ghost           1
Fire / Ghost           1
Name: Type, Length: 159, dtype: int64

In [51]:
# 수치형 데이터를 갖는 Series의 경우 범주를 나눠 값의 빈도를 확인 가능

# bins 인수에 값의 구간을 갖는 배열 혹은 리스트를 넘겨주면 된다.

bins = np.linspace(0, 1400, 8)
bins

array([   0.,  200.,  400.,  600.,  800., 1000., 1200., 1400.])

In [52]:
google.value_counts(bins = bins)

#출력 값에서
#소괄호((, ))는 해당 값의 미포함을 나타내며 
#대괄호([, ])는 해당 값을 포함한다는 의미입니다.

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [53]:
#연습문제
#google 변수가 가르키는 Series 객체에 대해서 [0, 200, 400, 600, 800, 1000, 1200, 1400]의 구간을 갖는 값의 개수를 구하고 인덱스 순으로 정렬해보세요.
bins = np.linspace(0,1400,8)
d = google.value_counts(bins = bins)
d.sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [54]:
#연습문제 다른 풀이
#google 변수가 가르키는 Series 객체에 대해서 [0, 200, 400, 600, 800, 1000, 1200, 1400]의 구간을 갖는 값의 개수를 구하고 인덱스 순으로 정렬해보세요.
bins = np.linspace(0,1400,8)
google.value_counts(bins = bins).sort_index()

(-0.001, 200.0]      595
(200.0, 400.0]      1568
(400.0, 600.0]       575
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1000.0, 1200.0]     406
(1200.0, 1400.0]      93
Name: Close, dtype: int64

In [55]:
# 범주를 정수로 전달하면 그 정수만큼 알아서 구간을 나눈다.
# (단 구간의 크기가 일정치 않을 수 있다.)
# 또 sort 인수에 False 값을 줘서 값을 기준으로 정렬하지 않을 수도 있다.
#대략적인 분포를 볼 때 쓰기 좋음

google.value_counts(bins = 8, sort = False)

(48.581, 204.54]       651
(204.54, 359.26]      1435
(359.26, 513.98]       263
(513.98, 668.7]        466
(668.7, 823.42]        334
(823.42, 978.14]       161
(978.14, 1132.86]      283
(1132.86, 1287.58]     231
Name: Close, dtype: int64

In [56]:
#Pandas 데이터 csv로 출력하기
d = {"c1" : [1,2,"누락"],
     "c2" : [1.11,"",3.33],
     "c3" : ["one","two","three"]}
df_csv = pd.DataFrame(d)
df_csv

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

In [57]:
# pandas 데이터를 csv 파일로 출력할 때 to_csv() 메서드 활용

# DataFrame.to_csv(path_or_buf = None, sep = ',', na_rep = '',
#                  float_format = None, columns = None, header = True,
#                  index = True, index_lable = None, mode = 'w',
#                  encoding = None, compression = 'infer',
#                  quoting = None, quotechar = '"',
#                  lineterminator = None, chuncksize = None,
#                  date_format = None, doublequote = True,
#                  escapechar = None, decimal = '.',
#                  error = 'strict', storage_options = None)

# 첫 인자로는 파일 경로 입력
# index의 default 값은  True이니 imdex를 굳이 안 쓸 때 
# index = Fasle 입력

In [58]:
#df_csv.to_csv(“파일이름 및 확장자", index=False)와 같이 사용합니다. 
#이 셀을 시작하고 우리가 notebook_dir로 설정한 C:\python 경로에 해당 파일이 생성되었나 확인해보시기 바랍니다.
df_csv.to_csv("datas/sample1.csv", index = False)

In [59]:
# 모든 인덱스 제거 후 저장(value값만 저장)

df_csv.to_csv("sample2.csv", index = False, header = False)
# index는 row index
# header는 column index

In [ ]:
#이번에는 만든 csv 파일로부터 데이터를 불러오는 작업을 진행하려 합니다. 
#이때는 read_csv() 메서드를 사용할 겁니다.
#키워드 사용

In [ ]:
#CSV 파일로부터 데이터를 읽어 DataFrame을 만들 때는 pandas.read_csv 함수를 사용합니다.
#함수의 첫 번째 인수로 “파일 이름.확장자” 문자열로 넣습니다.
#그럼 아래와 같이 DataFrame을 잘 불러오는 것을 확인할 수 있습니다.

In [80]:
# Pandas 데이터 입력
# read_csv() 메서드 활용
df_read = pd.read_csv("sample1.csv")
df_read # row index 정보가 없으므로 row index는 0부터 자동으로 시작

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

In [84]:
#이번에는 column 인덱스를 배제하고 저장해보겠습니다. 
#아래의 예제 코드와 같이 header=False 키워드 인수를 추가해주면 됩니다. 
#파일명을 “sample2.csv”로 지정하고 바로 실행해볼까요?

df_csv.to_csv("sample2.csv",index = False,header = False) #sample2.csv 저장

In [85]:
#  names 키워드를 통해 column 인덱스 추가
pd.read_csv("sample2.csv", names = ['c1', 'c2', 'c3']) #sample2.csv 불러오기

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

# 콤마가 아닌 텍스트 파일 처리

In [90]:
# %%writefile 파일명은 jupyter lab의 매직 명령어다.
# 이를 통해 파일을 저장 가능
#같은 셀 앞쪽에 주석이 있으면 안됌

In [93]:
%%writefile datas/sample3.txt
c1       c2       c3       c4
0.179181 -1.538472 1.347553 0.43381
1.024209 0.087307 -1.281997 0.49265
0.417899 -2.002308 0.255245 -1.10515

Overwriting datas/sample3.txt

In [94]:
# sep 인수를 통해 구분자(seperator)를 사용자가 지정

#, 데이터를 구분하는 구분자(separator)가 콤마(comma)가 아니면 
#sep 인수를 써서 구분자를 사용자가 지정해줘야 합니다.

# 만약 길이가 정해지지 않은 공백이 구분자인 경우에는
# '\s+' 정규식(regular expression) 문자열을 사용하면 된다.

pd.read_table('sample3.txt', sep = '\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [69]:
# 부가적인 텍스트 정보가 포함된 csv

In [95]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.txt

In [97]:
%%writefile datas/sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing datas/sample4.txt

In [96]:
# 데이터를 불러올 파일 중에 건너 뛰어야 할 행이 있다면 skiprow 인수 사용

# 리스트가 아닌 range()를 활용해도 됨

# pd.read_csv("sample4.txt", skiprows = [0, 1]) #0,1의 두 줄을 빼겠다
pd.read_csv("sample4.txt", skiprows = range(2))

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [98]:
# 자료 내부 특정한 값을 NaN 변경하는 방법

# na_values인수에 NaN값으로 취급할 값 입력

df_na_val = pd.read_csv('sample1.csv', na_values = ['누락'])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [99]:
# csv 생성 시 구분자 지정

# 파일을 읽을 때와 마찬가지로 파일을 출력할 때도 
# sep 인수로 구분자 변경 가능

df_na_val.to_csv('sample5.txt', sep = '|', index = False)

In [100]:
pd.read_csv('sample5.txt')

       c1|c2|c3
0  1.0|1.11|one
1      2.0||two
2   |3.33|three

In [101]:
pd.read_csv('sample5.txt', sep = '|')

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [102]:
# csv 생성 시 NaN 값에 값 넣기

In [103]:
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [104]:
# na_rep 인수를 통해 NaN 표시값 변경 가능
df_na_val.to_csv('sample6.csv', na_rep = '누락', index = False)

In [110]:
pd.read_csv("sample6.csv")

    c1    c2     c3
0  1.0  1.11    one
1  2.0    누락    two
2   누락  3.33  three

In [106]:
# 온라인의 csv 파일 가져오기

# read_csv 명령 사용시 path 대신 URL을 지정하면 
# Pandas가 직접 해당 파일을 다운로드하여 읽어들인다.

titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [113]:
titanic.describe()

         survived         age  n_siblings_spouses       parch        fare
count  627.000000  627.000000          627.000000  627.000000  627.000000
mean     0.387560   29.631308            0.545455    0.379585   34.385399
std      0.487582   12.511818            1.151090    0.792999   54.597730
min      0.000000    0.750000            0.000000    0.000000    0.000000
25%      0.000000   23.000000            0.000000    0.000000    7.895800
50%      0.000000   28.000000            0.000000    0.000000   15.045800
75%      1.000000   35.000000            1.000000    0.000000   31.387500
max      1.000000   80.000000            8.000000    5.000000  512.329200

In [111]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

In [114]:
#앞이나 뒤의 특정 개수만 보고 싶다면 head() 메서드나 tail() 메서드를 사용

In [108]:
titanic.head(3)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y

In [109]:
titanic.tail(3)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
624,1,female,19.0,0,0,30.00,First,B,Southampton,y
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y

In [127]:
library_path = 'datas/library.csv'
library_cols = ["library"]
library = pd.read_csv(library_path, encoding='cp949')
library

,도서관명,시도명,시군구명,도서관유형,휴관일,평일운영시작시각,평일운영종료시각,토요일운영시작시각,토요일운영종료시각,공휴일운영시작시각,...,대출가능일수,소재지도로명주소,운영기관명,도서관전화번호,부지면적,건물면적,홈페이지주소,위도,경도,데이터기준일자
0,옥정호수도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,18:00,00:00,...,14,경기도 양주시 옥정동로7길 110,경기도 양주시청,031-8082-7470,22510.0,4938.00,https://www.libyj.go.kr/ojlake/index.do,37.823000,127.094931,2023-02-15
1,장흥작은도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,22:00,00:00,...,14,경기도 양주시 장흥면 호국로 470,경기도 양주시청,031-844-0987,1353.0,398.00,https://www.libyj.go.kr/jhlib/index.do,37.713757,126.969372,2023-02-15
2,양주희망도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,22:00,00:00,...,14,경기도 양주시 삼숭로38번길 78-47,경기도 양주시청,031-8082-7460,3388.0,2299.00,https://www.libyj.go.kr/hmlib/index.do,37.795765,127.107258,2023-02-15
3,덕정도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,22:00,00:00,...,14,경기도 양주시 화합로1371번길 11,경기도 양주시청,031-8082-7420,949.0,1826.00,https://www.libyj.go.kr/djlib/index.do,37.842880,127.063191,2023-02-15
4,고읍도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,22:00,00:00,...,14,경기도 양주시 고읍남로 207,경기도 양주시청,031-8082-7440,1650.0,1337.00,https://www.libyj.go.kr/gulib/index.do,37.792050,127.084460,2023-02-15
5,꿈나무도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,22:00,00:00,...,14,경기도 양주시 백석읍 꿈나무로 199,경기도 양주시청,031-8082-7401,6073.0,2606.00,https://www.libyj.go.kr/childlib/index.do,37.792390,126.987275,2023-02-15
6,남면도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,18:00,09:00,18:00,00:00,...,14,경기도 양주시 남면 개나리17길 24,경기도 양주시청,031-8082-7430,2252.0,789.00,https://www.libyj.go.kr/nmlib/index.do,37.898148,126.975880,2023-02-15
7,덕계도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,18:00,00:00,...,14,경기도 양주시 평화로1475번길 39,경기도 양주시청,031-8082-7450,1499.0,1370.00,https://www.libyj.go.kr/dklib/index.do,37.821659,127.046729,2023-02-15
8,광적도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,18:00,00:00,...,14,경기도 양주시 광적면 광적로42번길 5,경기도 양주시청,031-8082-7480,1021.9,957.64,https://www.libyj.go.kr/gjlib/index.do,37.823117,126.982877,2023-02-15
9,고암작은도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,18:00,09:00,18:00,00:00,...,14,경기도 양주시 고암길 251-1 1층,경기도 양주시청,031-8082-7488,13887.1,236.00,https://www.libyj.go.kr/goamlib/index.do,37.834524,127.072931,2023-02-15

In [128]:
library_path = 'datas/library.csv'
library_cols = ["library"]
library = pd.read_table(library_path, encoding='cp949')
library

  도서관명,시도명,시군구명,도서관유형,휴관일,평일운영시작시각,평일운영종료시각,토요일운영시작시각,토요일운영종료시각,공휴일운영시작시각,공휴일운영종료시각,열람좌석수,자료수(도서),자료수(연속간행물),자료수(비도서),대출가능권수,대출가능일수,소재지도로명주소,운영기관명,도서관전화번호,부지면적,건물면적,홈페이지주소,위도,경도,데이터기준일자
0  옥정호수도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:0...
1  장흥작은도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:0...
2  양주희망도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:0...
3  덕정도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,...
4  고읍도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,...
5  꿈나무도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00...
6  남면도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,18:00,09:00,...
7  덕계도서관,경기도,양주시,공공도서관,금+법정공휴일,09:00,22:00,09:00,...
8  광적도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,22:00,09:00,...
9  고암작은도서관,경기도,양주시,공공도서관,월+법정공휴일,09:00,18:00,09:0...